# LossFactor Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BasicLossFactor..::..LossFactor Property
BasicLossFactor Class See Also
---
The loss factor.
**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public double LossFactor { get; set; }
```

Visual Basic
---
```text
Public Property LossFactor As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double LossFactor {
	double get ();
	void set (double value);
}
```

# ### Field Value
The loss factor as a numerical value between 0.0 and 4.0
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: The loss factor is not valid because it is not between 0.0 and 4.0. |

# See Also
BasicLossFactor Class
Autodesk.Revit.DB.Lighting Namespace